#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05YTY3MTU1Zi0wYWRhLTQ1YTQtYjhmNC02NDA1MGRkZWQxYWM7b2JqZWN0SWQ9MTZmMjAwYzctNzkxZS00NDZlLTlkNTQtZDZkOWY2ZGQ4MTgzO3N1YnNjcmlwdGlvbklkPWVkZDRjYzQ1LTg1YzctNGFlYy04YmY1LTY0ODA2MmQ1MTliZjt0ZW5hbnRJZD1iZjQ2NWRjNy0zYmM4LTQ5NDQtYjAxOC0wOTI1NzJiNWMyMGQ=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.hub.azurerm_firewall.this[0] will be created
  + resource "azurerm_firewall" "this" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "fw-hshub"
      + resource_group_name = "rg-hshub"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + tags                = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }
      + threat_intel_mode   = (known after apply)

      + ip_configuration {
          + name                 = "firewall-public-ip-config"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.hub.azurerm_firewall_policy.this[0] will be created
  + resource "azurerm_firewall_policy" "this" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = (known after apply)
      + resource_group_name      = "rg-hshub"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + tags                     = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }
      + threat_intelligence_mode = "Alert"
    }

  # module.hub.azurerm_firewall_policy_rule_collection_group.this[0] will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "this" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "hshub-databricks"
      + priority           = 200

      + application_rule_collection {
          + action   = "Allow"
          + name     = "hshub-databricks-app-rc"
          + priority = 101

          + rule {
              + destination_fqdns = [
                  + "python.org",
                  + "*.python.org",
                  + "pypi.org",
                  + "*.pypi.org",
                  + "pythonhosted.org",
                  + "*.pythonhosted.org",
                  + "cran.r-project.org",
                  + "*.cran.r-project.org",
                  + "r-project.org",
                ]
              + name              = "public-repos"
              + source_ip_groups  = (known after apply)

              + protocols {
                  + port = 443
                  + type = "Https"
                }
              + protocols {
                  + port = 80
                  + type = "Http"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "*.ipinfo.io",
                  + "ipinfo.io",
                ]
              + name              = "IPinfo"
              + source_ip_groups  = (known after apply)

              + protocols {
                  + port = 443
                  + type = "Https"
                }
              + protocols {
                  + port = 8080
                  + type = "Http"
                }
              + protocols {
                  + port = 80
                  + type = "Http"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "cdnjs.cloudflare.com",
                ]
              + name              = "ganglia"
              + source_ip_groups  = (known after apply)

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }

      + network_rule_collection {
          + action   = "Allow"
          + name     = "hshub-databricks-network-rc"
          + priority = 100

          + rule {
              + destination_addresses = [
                  + "AzureDatabricks",
                ]
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "adb-services"
              + protocols             = [
                  + "TCP",
                  + "UDP",
                ]
              + source_ip_groups      = (known after apply)
            }
          + rule {
              + destination_addresses = [
                  + "Storage.Northeurope",
                ]
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "adb-storage"
              + protocols             = [
                  + "TCP",
                  + "UDP",
                ]
              + source_ip_groups      = (known after apply)
            }
          + rule {
              + destination_addresses = [
                  + "Sql.Northeurope",
                ]
              + destination_ports     = [
                  + "3306",
                ]
              + name                  = "adb-sql"
              + protocols             = [
                  + "TCP",
                ]
              + source_ip_groups      = (known after apply)
            }
          + rule {
              + destination_addresses = [
                  + "EventHub.Northeurope",
                ]
              + destination_ports     = [
                  + "9093",
                ]
              + name                  = "adb-eventhub"
              + protocols             = [
                  + "TCP",
                ]
              + source_ip_groups      = (known after apply)
            }
        }
    }

  # module.hub.azurerm_ip_group.this will be created
  + resource "azurerm_ip_group" "this" {
      + firewall_ids        = (known after apply)
      + firewall_policy_ids = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "hshub-adb-subnets"
      + resource_group_name = "rg-hshub"
      + tags                = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }
    }

  # module.hub.azurerm_key_vault.this[0] will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "rg-hshub"
      + sku_name                      = "premium"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }
      + tenant_id                     = "bf465dc7-3bc8-4944-b018-092572b5c20d"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.hub.azurerm_key_vault_access_policy.databricks[0] will be created
  + resource "azurerm_key_vault_access_policy" "databricks" {
      + id              = (known after apply)
      + key_permissions = [
          + "Get",
          + "UnwrapKey",
          + "WrapKey",
        ]
      + key_vault_id    = (known after apply)
      + object_id       = "95d3a6b7-6d92-4488-8b53-02122c90d325"
      + tenant_id       = "bf465dc7-3bc8-4944-b018-092572b5c20d"
    }

  # module.hub.azurerm_key_vault_access_policy.terraform[0] will be created
  + resource "azurerm_key_vault_access_policy" "terraform" {
      + id              = (known after apply)
      + key_permissions = [
          + "Get",
          + "List",
          + "Create",
          + "Decrypt",
          + "Encrypt",
          + "Sign",
          + "UnwrapKey",
          + "Verify",
          + "WrapKey",
          + "Delete",
          + "Restore",
          + "Recover",
          + "Update",
          + "Purge",
          + "GetRotationPolicy",
        ]
      + key_vault_id    = (known after apply)
      + object_id       = "16f200c7-791e-446e-9d54-d6d9f6dd8183"
      + tenant_id       = "bf465dc7-3bc8-4944-b018-092572b5c20d"
    }

  # module.hub.azurerm_key_vault_key.managed_disk[0] will be created
  + resource "azurerm_key_vault_key" "managed_disk" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "kvk-hshub-adb-disk"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.hub.azurerm_key_vault_key.managed_services[0] will be created
  + resource "azurerm_key_vault_key" "managed_services" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "kvk-hshub-adb-services"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # module.hub.azurerm_private_dns_zone.key_vault[0] will be created
  + resource "azurerm_private_dns_zone" "key_vault" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-hshub"
      + tags                                                  = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }

      + soa_record (known after apply)
    }

  # module.hub.azurerm_private_dns_zone_virtual_network_link.key_vault[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "key_vault" {
      + id                    = (known after apply)
      + name                  = "hshub-keyvault-vnetlink"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-hshub"
      + tags                  = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.hub.azurerm_private_endpoint.key_vault[0] will be created
  + resource "azurerm_private_endpoint" "key_vault" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "pe-hshub-kv"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-hshub"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "keyvault"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "keyvault"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.hub.azurerm_public_ip.this[0] will be created
  + resource "azurerm_public_ip" "this" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = (known after apply)
      + resource_group_name     = "rg-hshub"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }
    }

  # module.hub.azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rg-hshub"
      + tags     = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }
    }

  # module.hub.azurerm_route.firewall_route[0] will be created
  + resource "azurerm_route" "firewall_route" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "to-firewall"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-hshub"
      + route_table_name       = "route-hshub"
    }

  # module.hub.azurerm_route_table.this will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "northeurope"
      + name                          = "route-hshub"
      + resource_group_name           = "rg-hshub"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }
    }

  # module.hub.azurerm_subnet.firewall[0] will be created
  + resource "azurerm_subnet" "firewall" {
      + address_prefixes                              = [
          + "10.0.1.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hshub"
      + virtual_network_name                          = "vnet-hshub"
    }

  # module.hub.azurerm_subnet.privatelink will be created
  + resource "azurerm_subnet" "privatelink" {
      + address_prefixes                              = [
          + "10.0.0.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "hub-privatelink"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hshub"
      + virtual_network_name                          = "vnet-hshub"
    }

  # module.hub.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.0.0.0/22",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "northeurope"
      + name                           = "vnet-hshub"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-hshub"
      + subnet                         = (known after apply)
      + tags                           = {
          + "Owner" = "hari.selvarajan@databricks.com"
        }
    }

  # module.hub.databricks_metastore.this will be created
  + resource "databricks_metastore" "this" {
      + cloud               = (known after apply)
      + created_at          = (known after apply)
      + created_by          = (known after apply)
      + force_destroy       = true
      + global_metastore_id = (known after apply)
      + id                  = (known after apply)
      + metastore_id        = (known after apply)
      + name                = "uc-metastore-hshub"
      + owner               = (known after apply)
      + region              = "northeurope"
      + updated_at          = (known after apply)
      + updated_by          = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.hub.databricks_mws_network_connectivity_config.this will be created
  + resource "databricks_mws_network_connectivity_config" "this" {
      + account_id                     = (known after apply)
      + creation_time                  = (known after apply)
      + id                             = (known after apply)
      + name                           = "ncc-for-hshub"
      + network_connectivity_config_id = (known after apply)
      + region                         = "northeurope"
      + updated_time                   = (known after apply)

      + egress_config (known after apply)
    }

  # module.spoke["spoke1"].data.azurerm_storage_account.dbfs will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account" "dbfs" {
      + access_tier                        = (known after apply)
      + account_kind                       = (known after apply)
      + account_replication_type           = (known after apply)
      + account_tier                       = (known after apply)
      + allow_nested_items_to_be_public    = (known after apply)
      + azure_files_authentication         = (known after apply)
      + custom_domain                      = (known after apply)
      + dns_endpoint_type                  = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + identity                           = (known after apply)
      + infrastructure_encryption_enabled  = (known after apply)
      + is_hns_enabled                     = (known after apply)
      + location                           = (known after apply)
      + name                               = (known after apply)
      + nfsv3_enabled                      = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + queue_encryption_key_type          = (known after apply)
      + resource_group_name                = (known after apply)
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + table_encryption_key_type          = (known after apply)
      + tags                               = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_databricks_access_connector.unity_catalog will be created
  + resource "azurerm_databricks_access_connector" "unity_catalog" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "databricks-mi-spoke1"
      + resource_group_name = "rg-spoke1"
      + tags                = {
          + "environment" = "test"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.spoke["spoke1"].azurerm_databricks_workspace.this will be created
  + resource "azurerm_databricks_workspace" "this" {
      + customer_managed_key_enabled          = true
      + disk_encryption_set_id                = (known after apply)
      + id                                    = (known after apply)
      + infrastructure_encryption_enabled     = true
      + location                              = "northeurope"
      + managed_disk_cmk_key_vault_key_id     = (known after apply)
      + managed_disk_identity                 = (known after apply)
      + managed_resource_group_id             = (known after apply)
      + managed_resource_group_name           = (known after apply)
      + managed_services_cmk_key_vault_key_id = (known after apply)
      + name                                  = "dbw-spoke1"
      + network_security_group_rules_required = "NoAzureDatabricksRules"
      + public_network_access_enabled         = false
      + resource_group_name                   = "rg-spoke1"
      + sku                                   = "premium"
      + storage_account_identity              = (known after apply)
      + tags                                  = {
          + "environment" = "test"
        }
      + workspace_id                          = (known after apply)
      + workspace_url                         = (known after apply)

      + custom_parameters {
          + nat_gateway_name                                     = (known after apply)
          + no_public_ip                                         = true
          + private_subnet_name                                  = "snet-spoke1-container"
          + private_subnet_network_security_group_association_id = (known after apply)
          + public_ip_name                                       = (known after apply)
          + public_subnet_name                                   = "snet-spoke1-host"
          + public_subnet_network_security_group_association_id  = (known after apply)
          + storage_account_name                                 = (known after apply)
          + storage_account_sku_name                             = (known after apply)
          + virtual_network_id                                   = (known after apply)
          + vnet_address_prefix                                  = (known after apply)
        }
    }

  # module.spoke["spoke1"].azurerm_databricks_workspace_root_dbfs_customer_managed_key.this[0] will be created
  + resource "azurerm_databricks_workspace_root_dbfs_customer_managed_key" "this" {
      + id               = (known after apply)
      + key_vault_key_id = (known after apply)
      + workspace_id     = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_ip_group_cidr.container will be created
  + resource "azurerm_ip_group_cidr" "container" {
      + cidr        = "10.1.4.0/22"
      + id          = (known after apply)
      + ip_group_id = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_ip_group_cidr.host will be created
  + resource "azurerm_ip_group_cidr" "host" {
      + cidr        = "10.1.0.0/22"
      + id          = (known after apply)
      + ip_group_id = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_key_vault_access_policy.dbmanageddisk will be created
  + resource "azurerm_key_vault_access_policy" "dbmanageddisk" {
      + id              = (known after apply)
      + key_permissions = [
          + "Get",
          + "UnwrapKey",
          + "WrapKey",
        ]
      + key_vault_id    = (known after apply)
      + object_id       = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_key_vault_access_policy.dbstorage will be created
  + resource "azurerm_key_vault_access_policy" "dbstorage" {
      + id              = (known after apply)
      + key_permissions = [
          + "Get",
          + "UnwrapKey",
          + "WrapKey",
        ]
      + key_vault_id    = (known after apply)
      + object_id       = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_network_security_group.this will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "nsg-spoke1"
      + resource_group_name = "rg-spoke1"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "test"
        }
    }

  # module.spoke["spoke1"].azurerm_network_security_rule.aad will be created
  + resource "azurerm_network_security_rule" "aad" {
      + access                      = "Allow"
      + destination_address_prefix  = "AzureActiveDirectory"
      + destination_port_range      = "443"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowAAD"
      + network_security_group_name = "nsg-spoke1"
      + priority                    = 200
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-spoke1"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.spoke["spoke1"].azurerm_network_security_rule.azfrontdoor will be created
  + resource "azurerm_network_security_rule" "azfrontdoor" {
      + access                      = "Allow"
      + destination_address_prefix  = "AzureFrontDoor.Frontend"
      + destination_port_range      = "443"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "AllowAzureFrontDoor"
      + network_security_group_name = "nsg-spoke1"
      + priority                    = 201
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-spoke1"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.spoke["spoke1"].azurerm_private_dns_zone.backend will be created
  + resource "azurerm_private_dns_zone" "backend" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azuredatabricks.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-spoke1"
      + tags                                                  = {
          + "environment" = "test"
        }

      + soa_record (known after apply)
    }

  # module.spoke["spoke1"].azurerm_private_dns_zone.dbfs_blob[0] will be created
  + resource "azurerm_private_dns_zone" "dbfs_blob" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-spoke1"
      + tags                                                  = {
          + "environment" = "test"
        }

      + soa_record (known after apply)
    }

  # module.spoke["spoke1"].azurerm_private_dns_zone.dbfs_dfs[0] will be created
  + resource "azurerm_private_dns_zone" "dbfs_dfs" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.dfs.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-spoke1"
      + tags                                                  = {
          + "environment" = "test"
        }

      + soa_record (known after apply)
    }

  # module.spoke["spoke1"].azurerm_private_dns_zone_virtual_network_link.backend will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "backend" {
      + id                    = (known after apply)
      + name                  = "databricks-vnetlink-backend"
      + private_dns_zone_name = "privatelink.azuredatabricks.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-spoke1"
      + tags                  = {
          + "environment" = "test"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_private_dns_zone_virtual_network_link.dbfs_blob[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dbfs_blob" {
      + id                    = (known after apply)
      + name                  = "dbfs-blob"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-spoke1"
      + tags                  = {
          + "environment" = "test"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_private_dns_zone_virtual_network_link.dbfs_dfs[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "dbfs_dfs" {
      + id                    = (known after apply)
      + name                  = "dbfs-dfs"
      + private_dns_zone_name = "privatelink.dfs.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-spoke1"
      + tags                  = {
          + "environment" = "test"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_private_endpoint.backend will be created
  + resource "azurerm_private_endpoint" "backend" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = (known after apply)
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-spoke1"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "environment" = "test"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-backend"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ple-spoke1-backend"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "databricks_ui_api",
            ]
        }
    }

  # module.spoke["spoke1"].azurerm_private_endpoint.dbfs_dfs[0] will be created
  + resource "azurerm_private_endpoint" "dbfs_dfs" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "dbfspe-dfs"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-spoke1"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "environment" = "test"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-dbfs"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ple-spoke1-dbfs-dfs"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.spoke["spoke1"].azurerm_private_endpoint.dbfspe_blob[0] will be created
  + resource "azurerm_private_endpoint" "dbfspe_blob" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "dbfs-blob"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-spoke1"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "environment" = "test"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-dbfs"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ple-spoke1-dbfs-blob"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.spoke["spoke1"].azurerm_private_endpoint.webauth will be created
  + resource "azurerm_private_endpoint" "webauth" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "webauth-private-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-spoke1"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "environment" = "test"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-webauth"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "pl-webauth"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "browser_authentication",
            ]
        }
    }

  # module.spoke["spoke1"].azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rg-spoke1"
      + tags     = {
          + "environment" = "test"
        }
    }

  # module.spoke["spoke1"].azurerm_role_assignment.this will be created
  + resource "azurerm_role_assignment" "this" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_storage_account.unity_catalog will be created
  + resource "azurerm_storage_account" "unity_catalog" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = true
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "northeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stspoke1uc"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-spoke1"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "test"
        }

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "None",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.spoke["spoke1"].azurerm_storage_container.unity_catalog will be created
  + resource "azurerm_storage_container" "unity_catalog" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "default"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_subnet.container will be created
  + resource "azurerm_subnet" "container" {
      + address_prefixes                              = [
          + "10.1.4.0/22",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-spoke1-container"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-spoke1"
      + virtual_network_name                          = "vnet-spoke1"

      + delegation {
          + name = "databricks-container-subnet-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  + "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.spoke["spoke1"].azurerm_subnet.host will be created
  + resource "azurerm_subnet" "host" {
      + address_prefixes                              = [
          + "10.1.0.0/22",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-spoke1-host"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-spoke1"
      + virtual_network_name                          = "vnet-spoke1"

      + delegation {
          + name = "databricks-host-subnet-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                  + "Microsoft.Network/virtualNetworks/subnets/prepareNetworkPolicies/action",
                  + "Microsoft.Network/virtualNetworks/subnets/unprepareNetworkPolicies/action",
                ]
              + name    = "Microsoft.Databricks/workspaces"
            }
        }
    }

  # module.spoke["spoke1"].azurerm_subnet.privatelink will be created
  + resource "azurerm_subnet" "privatelink" {
      + address_prefixes                              = [
          + "10.1.8.0/22",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-spoke1-pl"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-spoke1"
      + virtual_network_name                          = "vnet-spoke1"
    }

  # module.spoke["spoke1"].azurerm_subnet_network_security_group_association.container will be created
  + resource "azurerm_subnet_network_security_group_association" "container" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_subnet_network_security_group_association.host will be created
  + resource "azurerm_subnet_network_security_group_association" "host" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_subnet_route_table_association.container will be created
  + resource "azurerm_subnet_route_table_association" "container" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_subnet_route_table_association.host will be created
  + resource "azurerm_subnet_route_table_association" "host" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke["spoke1"].azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.1.0.0/20",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "northeurope"
      + name                           = "vnet-spoke1"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-spoke1"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "test"
        }
    }

  # module.spoke["spoke1"].azurerm_virtual_network_peering.hub_to_spoke will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke" {
      + allow_forwarded_traffic                = false
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "from-vnet-hshub-to-vnet-spoke1-peer"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-hshub"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-hshub"
    }

  # module.spoke["spoke1"].azurerm_virtual_network_peering.spoke_to_hub will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub" {
      + allow_forwarded_traffic                = false
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "from-vnet-spoke1-to-vnet-hshub-peer"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-spoke1"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-spoke1"
    }

  # module.spoke["spoke1"].databricks_metastore_assignment.this[0] will be created
  + resource "databricks_metastore_assignment" "this" {
      + default_catalog_name = (known after apply)
      + id                   = (known after apply)
      + metastore_id         = (known after apply)
      + workspace_id         = (known after apply)
    }

  # module.spoke["spoke1"].databricks_mws_ncc_binding.this will be created
  + resource "databricks_mws_ncc_binding" "this" {
      + id                             = (known after apply)
      + network_connectivity_config_id = (known after apply)
      + workspace_id                   = (known after apply)
    }

  # module.spoke["spoke1"].databricks_mws_ncc_private_endpoint_rule.dbfs_blob will be created
  + resource "databricks_mws_ncc_private_endpoint_rule" "dbfs_blob" {
      + connection_state               = (known after apply)
      + creation_time                  = (known after apply)
      + endpoint_name                  = (known after apply)
      + group_id                       = "blob"
      + id                             = (known after apply)
      + network_connectivity_config_id = (known after apply)
      + resource_id                    = (known after apply)
      + rule_id                        = (known after apply)
      + updated_time                   = (known after apply)
    }

  # module.spoke["spoke1"].databricks_mws_ncc_private_endpoint_rule.dbfs_dfs will be created
  + resource "databricks_mws_ncc_private_endpoint_rule" "dbfs_dfs" {
      + connection_state               = (known after apply)
      + creation_time                  = (known after apply)
      + endpoint_name                  = (known after apply)
      + group_id                       = "dfs"
      + id                             = (known after apply)
      + network_connectivity_config_id = (known after apply)
      + resource_id                    = (known after apply)
      + rule_id                        = (known after apply)
      + updated_time                   = (known after apply)
    }

  # module.spoke["spoke1"].databricks_mws_ncc_private_endpoint_rule.storage will be created
  + resource "databricks_mws_ncc_private_endpoint_rule" "storage" {
      + connection_state               = (known after apply)
      + creation_time                  = (known after apply)
      + endpoint_name                  = (known after apply)
      + group_id                       = "dfs"
      + id                             = (known after apply)
      + network_connectivity_config_id = (known after apply)
      + resource_id                    = (known after apply)
      + rule_id                        = (known after apply)
      + updated_time                   = (known after apply)
    }

  # module.spoke["spoke1"].random_string.dbfsnaming will be created
  + resource "random_string" "dbfsnaming" {
      + id          = (known after apply)
      + length      = 13
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.hub.module.naming.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.spoke["spoke1"].module.naming.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.spoke["spoke1"].module.naming.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 65 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hub_network_subnets     = {
      + firewall    = "10.0.1.0/26"
      + privatelink = "10.0.0.0/24"
    }
  + hub_resource_group_name = "rg-hshub"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>
*Pushed by: @HariGS-DB, Action: `pull_request`*